;*******************************************************************************************
;  FILE:   MORE Psionics Ex Machina. int                                 
;  
;	File created	25/07/20    21:00
;	LAST UPDATED    07/10/20    13:30
;
;*******************************************************************************************

[XComGame.UIAvengerShortcuts]
[UISL_AvengerHUD_Shortcuts_PexM]
;label gets the cool UI Psi Icon added to the front
LabelShortcut_PexMChamber="Experimental Psionics"
TooltipShortcut_PexMChamber="Visit Experimental Psionics"

[XComGame.UIFacility_PexMLab]
[UIFacility_PexMLab]
m_strStartProject="CHOOSE PSIONICS PROJECT"
m_strProjectedHours="PROJECTED HOURS:"
m_strProjectedDays="PROJECTED DAYS:"
m_strEmptyQueue="No items currently in build queue"
m_strCurrentProject="CURRENT:"
m_strCancelPexMProjectTitle="CANCEL PSIONICS PROJECT?"
m_strCancelPexMProjectBody="Are you sure you want to cancel the <XGParam:StrValue0/> project?"
m_strProgress="PROGRESS:"
m_strEditQueue="EDIT QUEUE"
m_strMoveItemUp="MOVE PROJECT UP"
m_strMoveItemDown="MOVE PROJECT DOWN"
m_strRemoveItem="CANCEL PROJECT"
m_strCheckInventory="VIEW PSI INVENTORY"

[UIFacility_PexMLabSlot]
m_strPexMTrainingDialogTitle="TRAINING: PSIONICS"
m_strPexMTrainingDialogText="<XGParam:StrValue0/!UnitName/> can undergo PSIONICS TRAINING. They will be unavailable for combat for <XGParam:IntValue0/!DaysToTrain/> days. Do you want to proceed?"
m_strStopPexMTrainingDialogTitle="CANCEL TRAINING"
m_strStopPexMTrainingDialogText="Do you want to stop %UNITNAME from training?\n\nWARNING: All progress will be lost."
m_strPauseAbilityTrainingDialogTitle="PAUSE TRAINING"
m_strPauseAbilityTrainingDialogText="Do you want to pause %UNITNAME's Psionic ability training?\n\nNOTE: Progress will be lost."
m_strNoSoldiersTooltip="There is no one left to train."
m_strSoldiersAvailableTooltip="Assign a soldier to undergo PSIONIC TRAINING."

[XComGame.UIChoosePexMProject]
[UIChoosePexMProject]
m_strTitle=EXPERIMENTAL PSIONICS
m_strSubTitleTitle= 
m_strInventoryLabel=EXPERIMENTAL PSIONICS
m_strPriority=[PRIORITY]
m_strPaused=[PAUSED]
m_strResume=[RESUME]
m_strEmptyListTitle=NO PSIONICS AVAILABLE
m_strBuy=[BEGIN]
m_strTime=Projected Progress:

[XComGame.UIInventory_PexM]
[UIInventory_PexM]
m_strTitleBig=PSIONICS STORAGE
m_strNoLoot=NO PSIONICS AVAILABLE
m_strBuy=

[X2EventListener_ClarityWillEvent]
ClarityActivated = "Clarity Coma"
